---
kind: method
id: M:Autodesk.Revit.DB.SaveAsOptions.GetWorksharingOptions
source: html/78d0d082-d68d-aa07-2b5e-1e67d5322050.htm
---
# Autodesk.Revit.DB.SaveAsOptions.GetWorksharingOptions Method

Gets Worksharing options for SaveAs.

## Syntax (C#)
```csharp
public WorksharingSaveAsOptions GetWorksharingOptions()
```

## Returns
Defaults to Nothing nullptr a null reference ( Nothing in Visual Basic) .
 For a workshared model, if Nothing nullptr a null reference ( Nothing in Visual Basic) default values for WorksharingSaveAsOptions are used.